Revit 2027 API
SunAndShadowSettings.IsFrameValid Method
 Checks whether the frame is valid for the supplied SunAndShadowSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFrameValid(
	double frame
)
Public Function IsFrameValid (
	frame As Double
) As Boolean
public:
bool IsFrameValid(
	double frame
)
member IsFrameValid :
        frame : float -> bool
Parameters
frame Double
 Frame value
Return Value
Boolean
 True if the frame is valid for the SunAndShadowSettings, false otherwise.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace